#+CALL: Setup()
#+TITLE: Example 

bibliographystyle:plain

* A bibliographic reference
  Test bibliography:

* The bibliography
  # +BIBLIOGRAPHY: ../bibliography/bibliography plain limit:t
#+BEGIN_EXPORT latex
\printbibliography
#+END_EXPORT

# bibliography:../bibliography/bibliography.bib



#+BEGIN_SRC emacs-lisp
(setq org-ref-bibliography-entry-format
      '(("article" . "<li><a name=\"\%k\"></a>%a, %t, <i>%j</i>, <b>%v(%n)</b>, %p (%y). <a href=\"%U\">link</a>. <a href=\"https://doi.org/%D\">doi</a>.</li>")
        ("book" . "<li><a name=\"\%k\"></a>%a, %t, %u (%y).</li>")))
 #+END_SRC

 #+RESULTS:
 : ((article . <li><a name="%k"></a>%a, %t, <i>%j</i>, <b>%v(%n)</b>, %p (%y). <a href="%U">link</a>. <a href="https://doi.org/%D">doi</a>.</li>) (book . <li><a name="%k"></a>%a, %t, %u (%y).</li>))
